[
  {
    "id": 8,
    "type": "AI Powered Teaching Assistant for Data Science",
    "name": "TeachingAssistant",
    "image": "images/projects/AIAssistent.jpg",
    "techStack": "OpenAI, Flask, PostgreSQL",
    "githubLink": "https://github.com/NarcisNacev1/UACS-AI-Powered-Teaching-Assistant-for-Data-Science",
    "description": "The AI-Powered Teaching Assistant is an API designed to assist students in various courses. It uses OpenAI's language models to answer questions based on course materials, providing real-time interaction and logging. The assistant allows students to submit questions and receive relevant responses, streams responses for an engaging user experience, and logs all interactions for auditing and debugging. It uses .env files for secure configuration, processes course materials to create a vector store, and stores questions and answers in a PostgreSQL database.",
    "status": "Finished"
  },
  {
    "id": 7,
    "type": "Matching your Career Opportunities",
    "name": "NextMatch",
    "image": "images/projects/NextMatch.jpg",
    "techStack": "Django, React, PostgreSQL, ScrapingDogAPI",
    "githubLink": "https://github.com/NarcisNacev1/jobfinder-backend",
    "description": "Job Finder Backend is a Django REST framework project that manages CV uploads, fetches job data from external APIs, and ranks job positions based on relevance to a user's CV. It allows users to upload their CV in PDF format, extracts skills, education, and experience, and integrates with the ScrapingDog API to fetch job postings. The project uses TF-IDF and cosine similarity for relevance scoring and ensures unique positions for the same company are not duplicated. The frontend of this project uses React.",
    "status": "Finished"
  },
  {
    "id": 6,
    "type": "Automated User Real-time Observation and Reporting Assistant",
    "name": "AURORA",
    "image": "images/projects/AURORA.jpg",
    "techStack": "Linux, Bash, Python",
    "githubLink": "https://github.com/NarcisNacev1/PRISM",
    "description": "AURORA is a Linux-based system monitoring tool designed for real-time diagnostics, activity tracking, and camera & system snapshots. It ensures critical system data is logged and monitored effectively, providing alerts via email to keep users informed of system anomalies or updates. PRISM includes features like real-time monitoring of CPU, memory, and disk usage, logging of web activity, periodic screenshots and webcam snapshots, and automated email notifications. Additionally, it offers USB automation for seamless execution of monitoring tasks from a USB drive, making it easy to set up and begin monitoring instantly.",
    "status": "Finished"
  },
  {
    "id": 5,
    "type": "Social Media Platform",
    "name": "Scripted",
    "image": "images/projects/Scripted.jpg",
    "techStack": "Django, React, PostgreSQL",
    "githubLink": " ",
    "description": "Scripted is a collaborative project I'm developing with colleagues from Macedonia. It’s a social media platform tailored for developers, offering features like post creation, commenting, liking, following, and direct messaging. Designed to foster connection and collaboration, Scripted serves as a space for developers of all levels to share knowledge and build their networks.",
    "status": "In Progress"
  },
  {
    "id": 4,
    "type": "Voice Recognition / Text Editor",
    "name": "Python Audio Text Editor",
    "image": "images/projects/PythonAudioTextEditor.jpg",
    "techStack": "Python",
    "githubLink": "https://github.com/NarcisNacev1/PythonAudioTextEditor",
    "description": "A unique text editor application built in Python with a voice recognition feature. This program allows users to dictate text, which the editor then transcribes, creating an interactive and hands-free text-editing experience.",
    "status": "Finished"
  },
  {
    "id": 3,
    "type": "Portfolio Management Application",
    "name": "Cryptocurrency Portfolio Tracker",
    "image": "images/projects/CryptocurrencyPortfolioTracker.jpg",
    "techStack": "Django, PostgreSQL",
    "githubLink": "https://github.com/NarcisNacev1/Cryptocurrency-Portfolio-Tracker",
    "description": "This application is a robust platform for managing cryptocurrency investments, designed to help users track real-time price updates, add and manage transactions, and monitor portfolio performance. Built with a focus on functionality and efficiency, this project utilizes Flask for backend development and integrates PostgreSQL for data storage, making it an excellent tool for cryptocurrency portfolio management.",
    "status": "Finished"
  },
  {
    "id": 2,
    "type": "2D C++ Game",
    "name": "The Lonely Knight",
    "image": "images/projects/LonleyKnight1.jpg",
    "techStack": "C++",
    "githubLink": "https://github.com/NarcisNacev1/GameEngine-LonleyKnightGame",
    "description": "This project is my first substantial game development experience, which I created at the end of my first year at university. Designed as a 2D action-adventure game, LonelyKnight challenged me to apply core C++ concepts in a real-world application. Developing this game required a lot of persistence, troubleshooting, and creative problem-solving, but seeing the final product was highly rewarding.",
    "status": "Finished"
  },
  {
    "id": 1,
    "type": "Data Extraction Tool",
    "name": "Web Scraper",
    "image": "images/projects/WebScraper.jpg",
    "techStack": "Python",
    "githubLink": "https://github.com/NarcisNacev1/WebScraper",
    "description": "This web scraper is designed to fetch data on top players from the GPlay Dota Premium Ladder page. By utilizing Python's requests library for HTTP requests and BeautifulSoup4 for HTML parsing, the scraper extracts and organizes player names along with their associated points, making it easy to retrieve and analyze ranking data.",
    "status": "Finished"
  }
]
